Autodesk.Revit.DB.DirectContext3D.IndexTriangle.GetSizeInShortInts
Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.
Returns:
The number of short integers occupied by the primitive.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexTriangle.Index2
The index of the triangle's third vertex.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexTriangle.Index1
The index of the triangle's second vertex.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexTriangle.Index0
The index of the triangle's first vertex.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexTriangle.#ctor(System.Int32,System.Int32,System.Int32)
Constructs the triangle primitive.
index0:
The index of the triangle's first vertex.
index1:
The index of the triangle's second vertex.
index2:
The index of the triangle's third vertex.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexTriangle
A triangle primitive consisting of three indices.
Remarks:
Indices of a triangle's vertices can be listed in either the clockwise or counterclockwise winding order,
according to the triangle's orientation in space. A DirectContext3D triangle faces the viewer if its vertices
are in counterclockwise order from the viewer's point of view.
Since:
2017